return {
  [1] = {
    ["type"] = 201,
    ["name"] = "经典好友房",
    ["count"] = 6,
    ["cost"] = 2,
  },
  [2] = {
    ["type"] = 201,
    ["name"] = "经典好友房",
    ["count"] = 9,
    ["cost"] = 3,
  },
  [3] = {
    ["type"] = 201,
    ["name"] = "经典好友房",
    ["count"] = 15,
    ["cost"] = 5,
  },
  [4] = {
    ["type"] = 202,
    ["name"] = "癞子好友房",
    ["count"] = 6,
    ["cost"] = 2,
  },
  [5] = {
    ["type"] = 202,
    ["name"] = "癞子好友房",
    ["count"] = 9,
    ["cost"] = 3,
  },
  [6] = {
    ["type"] = 202,
    ["name"] = "癞子好友房",
    ["count"] = 15,
    ["cost"] = 5,
  },
  [7] = {
    ["type"] = 10001,
    ["name"] = "血战到底好友房",
    ["count"] = 4,
    ["cost"] = 2,
  },
  [8] = {
    ["type"] = 10001,
    ["name"] = "血战到底好友房",
    ["count"] = 8,
    ["cost"] = 4,
  },
}