return {
  [201] = {
    ["name"] = "网络连接中断！",
  },
  [202] = {
    ["name"] = "提示",
  },
  [203] = {
    ["name"] = "是否退出游戏？",
  },
  [301] = {
    ["name"] = "取消",
  },
  [302] = {
    ["name"] = "确定",
  },
  [303] = {
    ["name"] = "返回错误码",
  },
  [304] = {
    ["name"] = "提示",
  },
  [401] = {
    ["name"] = [[游戏简介
星空互娱全力倾心打造，打牌流畅，精美界面，经典玩法和癞子玩法，每天登陆送海量金币，还可以邀请好友一起开好友房约牌]],
  },
  [402] = {
    ["name"] = [[版权所有 深圳市星空互娱科技有限公司
Copyright（c）2017 Starry Sky entertainment All Rights Reserved
抵制不良游戏，拒绝盗版游戏。注意自我保护，谨防受骗上当。适度游戏益脑，沉迷游戏伤身。合理安排时间，享受健康生活。]],
  },
  [501] = {
    ["name"] = "今天第{0}次领取{1}补助金",
  },
  [502] = {
    ["name"] = "您已成功获得小地主无偿资助的{0}金币！",
  },
  [601] = {
    ["name"] = "支付失败，请稍后再试",
  },
  [602] = {
    ["name"] = "钻石不足，是否用【￥{0}】充值【{1}钻石】？充值成功将为您自动购买【{2}*{3}】",
  },
  [603] = {
    ["name"] = "系统繁忙，请稍后再试",
  },
  [701] = {
    ["name"] = "金币都输光了喔",
  },
  [702] = {
    ["name"] = "赢取的金币已经达到本场的封顶",
  },
  [703] = {
    ["name"] = "有{0}金币，最多只能赢{0}金币",
  },
  [704] = {
    ["key"] = "prompt_logout",
    ["name"] = "是否要注销当前{0}账号？",
  },
  [705] = {
    ["key"] = "verify_failed",
    ["name"] = "获取验证码失败，请稍后再试",
  },
  [706] = {
    ["key"] = "playing_return",
    ["name"] = "检测到您有正在进行中的对局，是否回到该游戏中？",
  },
  [707] = {
    ["key"] = "money_lack_buy",
    ["name"] = "你的金币不足,是否去购买金币",
  },
  [708] = {
    ["key"] = "money_lack_low",
    ["name"] = "你的金币不足,是否尝试去低级场?",
  },
  [709] = {
    ["key"] = "XK_show",
    ["name"] = "【星空斗地主】 安利时间到！",
  },
  [710] = {
    ["key"] = "invite_friend",
    ["name"] = "约上小伙伴们来开房吧~",
  },
  [711] = {
    ["key"] = "download_site",
    ["name"] = "http://www.starry365.com/download",
  },
  [712] = {
    ["key"] = "confirm_leave",
    ["name"] = "确认要离开吗？",
  },
  [713] = {
    ["key"] = "robot_leave",
    ["name"] = "离开会由笨笨的机器人替你打牌，确认要离开吗？",
  },
  [714] = {
    ["key"] = "hint_dissolve",
    ["name"] = "好友房不能离开，先解散",
  },
  [715] = {
    ["key"] = "confirm_dissolve",
    ["name"] = "确定要解散房间吗？",
  },
  [716] = {
    ["key"] = "seek_player",
    ["name"] = "正在匹配玩家...",
  },
  [717] = {
    ["key"] = "official_website",
    ["name"] = "http://www.starry365.com",
  },
  [718] = {
    ["key"] = "acquisition_subvention",
    ["name"] = "你已成功获得小地主无偿资助的{0}金币！",
  },
  [719] = {
    ["key"] = "landlord_subvention",
    ["name"] = "江湖救急，小地主第{0}次无偿支援你{1}金币呦！,快点反败为胜吧！",
  },
  [720] = {
    ["key"] = "acquire_verification_failed",
    ["name"] = "获取验证码失败，请稍后再试",
  },
  [721] = {
    ["key"] = "login_verify_failed",
    ["name"] = "登录验证失败，请稍后再试",
  },
  [722] = {
    ["key"] = "registered_login",
    ["name"] = "该手机号已被注册，是否前往登录？",
  },
  [723] = {
    ["key"] = "inexistence_register",
    ["name"] = "该手机号不存在，是否前往注册？",
  },
  [724] = {
    ["key"] = "vertify_failed_wait",
    ["name"] = "登录验证失败，请稍后再试",
  },
  [725] = {
    ["key"] = "wechat_error_code",
    ["name"] = "微信登录SDK返回错误码",
  },
  [726] = {
    ["key"] = "continuous_signin",
    ["name"] = "已连续签到{0}天",
  },
  [727] = {
    ["key"] = "money_lack_undouble",
    ["name"] = "您的金币不足8000，无法加倍",
  },
  [728] = {
    ["key"] = "card_less_than",
    ["name"] = "您没有牌大过上家",
  },
  [729] = {
    ["key"] = "send_succeed",
    ["name"] = "发送成功",
  },
  [730] = {
    ["key"] = "room_dissolve",
    ["name"] = "房间已经解散",
  },
  [731] = {
    ["key"] = "room_dissolve_failed",
    ["name"] = "房间解散失败",
  },
  [732] = {
    ["key"] = "classical_game",
    ["name"] = "经典斗地主",
  },
  [733] = {
    ["key"] = "laizi_game",
    ["name"] = "癞子斗地主",
  },
  [734] = {
    ["key"] = "day_task",
    ["name"] = "每日任务",
  },
  [735] = {
    ["key"] = "week_task",
    ["name"] = "每周任务",
  },
  [801] = {
    ["key"] = "xz_majiang_game",
    ["name"] = "血战麻将",
  },
  [802] = {
    ["key"] = "xz_majiang_baseintro",
    ["name"] = [[1.用牌：1-9筒，1-9万，1-9条，共108张牌
2.可以碰，杠，不可以吃
3.缺一门才可胡，即胡牌的时候不能有三种花色的牌
4.【刮风下雨】：点杠收取放杠者2倍游戏币，补杠收取其他玩家1倍游戏币，暗杠收取其他玩家2倍游戏币
5.【退税】：牌局结束时玩家未听牌，则退回全部刮风下雨所得
6.【查花猪】：牌局结束时手牌有三种花色的玩家为花猪，花猪赔给非花猪玩家封顶倍数
7.【查大叫】：牌局结束时未听牌的玩家（花猪不用）赔给听牌的玩家最大可能倍数
8.【呼叫转移】：即某玩家杠牌后打出的牌其他玩家可以胡，那么该玩家的刮风下雨所得则转移给胡牌玩家。
9.【一炮多响】：点炮后可多个玩家胡牌，点炮这与每个被点跑者单独结算]],
  },
  [803] = {
    ["key"] = "xz_majiang_fanxing",
    ["name"] = [[基本番型
【平胡】X1   即普通的4坎牌加1对将
【对对胡】X2 即4副刻子(杠)加1对将【清一色】X4 即胡牌时只有1种花色
【带幺九】X4 即每副顺子、刻子（杠）和将牌都含有一或九
【七对】X4   玩家手牌全部是两张一对的，没有碰过和杠过
【金钩钩】X4 所有牌都已碰出或杠出，手里就只剩一张牌单吊胡牌
【清对】X4   清一色的对对胡
【龙七对】X4 即在七对的基础上，有4张牌一样的。注：此四张一样的牌不再计算为根。
【清七对】X4 同一种花色的七对
【清幺九】X4 清一色的幺九
【将金钩钩】X4 金钩钓里手牌，碰牌和杠牌的牌必须是2，5，8
【清金钩钩】X4 金钩钓胡牌时的牌型都为同一花色
【天胡】X4 打牌的过程中，庄家在第一次模完牌后，就胡牌，叫天胡。
【地胡】X4 在打牌过程中，非庄家在第一次摸完牌后就可以下叫，第一轮摸牌后就胡牌，叫地胡。
【清龙七对】X4 玩家手牌是清一色的龙七对
【十八罗汉】X4 在金钩钓里，若有四个杠，此时所有的牌有18张，称为十八罗汉
【清十八罗汉】X4 清一色的十八罗汉
杠上花 1番 玩家杠了后摸1张牌来胡了。
杠上炮 1番 杠了后打出1张牌其他玩家胡了为杠上炮
抢杠 1番 玩家在补杠时其他玩家可以胡这张牌，这时可以抢杠。
根 1番 玩家胡牌的时候手上有四张一样的牌为一根]],
  },
  [805] = {
    ["key"] = "xz_majiang_result",
    ["name"] = "赢取的金币=底分*2^（N-1）（N为番数）+自己收取的杠钱-自己应该给别人的杠钱-自己应该给别人胡牌的钱；",
  },
  [806] = {
    ["key"] = "xl_majiang_game",
  },
  [807] = {
    ["key"] = "xl_majiang_baseintro",
  },
  [808] = {
    ["key"] = "xl_majiang_fanxing",
  },
  [809] = {
    ["key"] = "xl_majiang_otherintro",
  },
  [810] = {
    ["key"] = "xl_majiang_result",
  },
  [901] = {
    ["key"] = "main_ddz_name",
    ["name"] = "斗地主",
  },
  [902] = {
    ["key"] = "main_xz_name",
    ["name"] = "血战麻将",
  },
  [903] = {
    ["key"] = "main_ddz_intro",
    ["name"] = "斗地主：游戏由3个玩家进行，用一副54张牌(包括大小王)，其中一方为地主，其余两家为另一方，双方对战，先出完牌的一方获胜。更有叫抢，叫分，明牌，癞子等多种玩法，消磨无聊时间的强力神器！还犹豫什么，赶快来玩吧。",
  },
  [904] = {
    ["key"] = "main_xz_intro",
    ["name"] = "血战到底：血战到底也称为血战麻将，是四川乃至全国都非常流行的打法，其核心是必须缺一门，一家胡牌后，若桌子上还有规定数量的牌，其它玩家就必须继续游戏直到结束。更有刺激房卡模式，喊上好友一起开约",
  },
  [10000] = {
    ["name"] = "参数错误",
  },
  [10001] = {
    ["name"] = "账号验证失败！",
  },
  [10002] = {
    ["name"] = "游客注册失败！",
  },
  [10003] = {
    ["name"] = "手机已被注册！",
  },
  [10004] = {
    ["name"] = "请耐心等待验证码！",
  },
  [10005] = {
    ["name"] = "手机注册失败！",
  },
  [10006] = {
    ["name"] = "获取手机验证码失败！",
  },
  [10007] = {
    ["name"] = "手机登录验证失败！",
  },
  [10008] = {
    ["name"] = "验证码不正确或已过期",
  },
  [10009] = {
    ["name"] = "该手机不存在",
  },
  [10010] = {
    ["name"] = "校验失败请重试",
  },
  [10011] = {
    ["name"] = "登录过期",
  },
  [10014] = {
    ["name"] = "手机已被注册",
  },
  [10015] = {
    ["name"] = "请耐心等待验证码",
  },
  [10020] = {
    ["name"] = "没有玩家在该位置上",
  },
  [10021] = {
    ["name"] = "房间密码错误",
  },
  [10022] = {
    ["name"] = "金币不足",
  },
  [10023] = {
    ["name"] = "宝石不足",
  },
  [10024] = {
    ["name"] = "金币超过上限",
  },
  [10025] = {
    ["name"] = "该房间类型配置错误",
  },
  [10026] = {
    ["name"] = "玩家没在牌桌上面",
  },
  [10027] = {
    ["name"] = "玩家不在匹配队列里面",
  },
  [10028] = {
    ["name"] = "玩家已经在牌局中",
  },
  [10029] = {
    ["name"] = "玩家已经在匹配队列中",
  },
  [10030] = {
    ["name"] = "好友房配置错误",
  },
  [10031] = {
    ["name"] = "房卡不足",
  },
  [10032] = {
    ["name"] = "加倍卡不足",
  },
  [10033] = {
    ["name"] = "房间解散失败",
  },
  [10034] = {
    ["name"] = "没有记牌器",
  },
  [10050] = {
    ["name"] = "桌子已经不存在了",
  },
  [10040] = {
    ["name"] = "今日已经签到",
  },
  [10041] = {
    ["name"] = "任务不存在",
  },
  [10042] = {
    ["name"] = "已经领取",
  },
  [10043] = {
    ["name"] = "不可领取",
  },
  [10045] = {
    ["name"] = "好友房暂时无法进入",
  },
  [10051] = {
    ["name"] = "没有这个好友房",
  },
  [10052] = {
    ["name"] = "已经改过名字，不能再次修改",
  },
  [10053] = {
    ["name"] = "好友房暂时无法进入",
  },
  [10054] = {
    ["name"] = "没有权限",
  },
  [10055] = {
    ["name"] = "已经同意解散房间",
  },
  [10056] = {
    ["name"] = "好友房已满",
  },
  [10057] = {
    ["name"] = "不能改变名字",
  },
  [10058] = {
    ["name"] = "非法性别",
  },
  [10059] = {
    ["name"] = "名字非法",
  },
  [10060] = {
    ["name"] = "已经开局不能离开",
  },
  [10061] = {
    ["name"] = "正在牌局中，不能购买",
  },
  [10062] = {
    ["name"] = "发言太快",
  },
  [10063] = {
    ["name"] = "您已经在对局中无法进入好友房",
  },
  [10064] = {
    ["name"] = "出牌阶段不能明牌",
  },
}